{"generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "format": "layers-model", "weightsManifest": [{"weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"keras_version": "2.4.0", "model_config": {"config": {"layers": [{"config": {"name": "input_1", "ragged": false, "sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 3]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"name": "activation", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation", "class_name": "Activation", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"config": {"name": "activation_1", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"name": "activation_2", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"name": "activation_3", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"name": "activation_4", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"name": "activation_5", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"name": "activation_6", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"name": "activation_7", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"name": "activation_8", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"name": "activation_9", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"name": "activation_10", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "groups": 1, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "dtype": "float32"}, "name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"config": {"name": "activation_11", "activation": "elu", "trainable": true, "dtype": "float32"}, "name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "global_average_pooling2d", "trainable": true, "dtype": "float32"}, "name": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense", "dtype": "float32", "use_bias": true, "activation": "sigmoid", "bias_regularizer": null}, "name": "dense", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}], "output_layers": [["dense", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "deepdog"}, "class_name": "Model"}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"config": {"name": "Adam", "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}, "class_name": "Adam"}}, "backend": "tensorflow"}}