{"convertedBy": "TensorFlow.js Converter v2.3.0", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_40/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_40/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_40/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_40/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_41/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_41/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_41/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_41/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_42/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_42/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_42/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_42/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_43/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_43/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_43/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_43/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_44/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_44/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_44/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_44/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_45/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_45/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_45/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_45/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_46/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_46/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_46/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_46/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_47/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_47/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_47/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_47/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_48/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_48/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_48/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_48/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_49/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_49/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_49/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_49/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_50/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_50/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_50/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_50/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_51/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_51/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_51/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_51/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_29/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_29/bias"}, {"dtype": "float32", "shape": [512, 1], "name": "dense_5/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_5/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "separable_conv2d_12/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "separable_conv2d_12/pointwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "separable_conv2d_12/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "separable_conv2d_13/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "separable_conv2d_13/pointwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "separable_conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "separable_conv2d_14/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "separable_conv2d_14/pointwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "separable_conv2d_14/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "separable_conv2d_15/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "separable_conv2d_15/pointwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "separable_conv2d_15/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "separable_conv2d_16/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "separable_conv2d_16/pointwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "separable_conv2d_16/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "separable_conv2d_17/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "separable_conv2d_17/pointwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "separable_conv2d_17/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "separable_conv2d_18/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "separable_conv2d_18/pointwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "separable_conv2d_18/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "separable_conv2d_19/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "separable_conv2d_19/pointwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "separable_conv2d_19/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "separable_conv2d_20/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "separable_conv2d_20/pointwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "separable_conv2d_20/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "separable_conv2d_21/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "separable_conv2d_21/pointwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "separable_conv2d_21/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "separable_conv2d_22/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "separable_conv2d_22/pointwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "separable_conv2d_22/bias"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"keras_version": "2.2.4", "model_config": {"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 3], "name": "input_5", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_5"}, {"config": {"strides": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_29", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 32, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "conv2d_29"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_40", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_40"}, {"config": {"trainable": true, "name": "activation_40", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]], "name": "activation_40"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_12", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_40", 0, 0, {}]]], "name": "separable_conv2d_12"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_41", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_12", 0, 0, {}]]], "name": "batch_normalization_41"}, {"config": {"trainable": true, "name": "activation_41", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]], "name": "activation_41"}, {"config": {"strides": [2, 2], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_13", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 64, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_41", 0, 0, {}]]], "name": "separable_conv2d_13"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_42", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_13", 0, 0, {}]]], "name": "batch_normalization_42"}, {"config": {"trainable": true, "name": "activation_42", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]], "name": "activation_42"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_14", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 128, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_42", 0, 0, {}]]], "name": "separable_conv2d_14"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_43", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_14", 0, 0, {}]]], "name": "batch_normalization_43"}, {"config": {"trainable": true, "name": "activation_43", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_43", 0, 0, {}]]], "name": "activation_43"}, {"config": {"strides": [2, 2], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_15", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 128, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_43", 0, 0, {}]]], "name": "separable_conv2d_15"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_44", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_15", 0, 0, {}]]], "name": "batch_normalization_44"}, {"config": {"trainable": true, "name": "activation_44", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_44", 0, 0, {}]]], "name": "activation_44"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_16", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 256, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_44", 0, 0, {}]]], "name": "separable_conv2d_16"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_45", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_16", 0, 0, {}]]], "name": "batch_normalization_45"}, {"config": {"trainable": true, "name": "activation_45", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_45", 0, 0, {}]]], "name": "activation_45"}, {"config": {"strides": [2, 2], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_17", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 256, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_45", 0, 0, {}]]], "name": "separable_conv2d_17"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_46", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_17", 0, 0, {}]]], "name": "batch_normalization_46"}, {"config": {"trainable": true, "name": "activation_46", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_46", 0, 0, {}]]], "name": "activation_46"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_18", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 512, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_46", 0, 0, {}]]], "name": "separable_conv2d_18"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_47", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_18", 0, 0, {}]]], "name": "batch_normalization_47"}, {"config": {"trainable": true, "name": "activation_47", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_47", 0, 0, {}]]], "name": "activation_47"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_19", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 512, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_47", 0, 0, {}]]], "name": "separable_conv2d_19"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_48", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_19", 0, 0, {}]]], "name": "batch_normalization_48"}, {"config": {"trainable": true, "name": "activation_48", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_48", 0, 0, {}]]], "name": "activation_48"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_20", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 512, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_48", 0, 0, {}]]], "name": "separable_conv2d_20"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_49", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_20", 0, 0, {}]]], "name": "batch_normalization_49"}, {"config": {"trainable": true, "name": "activation_49", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]], "name": "activation_49"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_21", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 512, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_49", 0, 0, {}]]], "name": "separable_conv2d_21"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_50", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_21", 0, 0, {}]]], "name": "batch_normalization_50"}, {"config": {"trainable": true, "name": "activation_50", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_50", 0, 0, {}]]], "name": "activation_50"}, {"config": {"strides": [1, 1], "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_22", "pointwise_regularizer": null, "depthwise_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "depthwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 512, "padding": "same", "bias_regularizer": null}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_50", 0, 0, {}]]], "name": "separable_conv2d_22"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "batch_normalization_51", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_22", 0, 0, {}]]], "name": "batch_normalization_51"}, {"config": {"trainable": true, "name": "activation_51", "activation": "elu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_51", 0, 0, {}]]], "name": "activation_51"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_3"}, "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["activation_51", 0, 0, {}]]], "name": "global_average_pooling2d_3"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]], "name": "dense_5"}], "output_layers": [["dense_5", 0, 0]], "name": "deepdog", "input_layers": [["input_5", 0, 0]]}, "class_name": "Model"}, "backend": "tensorflow", "training_config": {"metrics": ["accuracy"], "optimizer_config": {"config": {"epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "lr": 0.0010000000474974513, "decay": 0.0, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "loss": "binary_crossentropy", "loss_weights": null, "sample_weight_mode": null}}, "format": "layers-model", "generatedBy": "keras v2.2.4"}