{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "name": "batch_normalization_22/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_22/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_22/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_22/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_23/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_23/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_23/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_23/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_24/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_24/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_24/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_24/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_25/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_25/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_25/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_25/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_26/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_26/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_26/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_26/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_27/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_27/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_27/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_27/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_29/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_29/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_29/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_29/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_30/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_30/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_30/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_30/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv2d_11/kernel", "shape": [3, 3, 3, 32]}, {"dtype": "float32", "name": "conv2d_11/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_12/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_12/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_13/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_13/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_14/kernel", "shape": [3, 3, 64, 128]}, {"dtype": "float32", "name": "conv2d_14/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_15/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_15/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_16/kernel", "shape": [3, 3, 128, 256]}, {"dtype": "float32", "name": "conv2d_16/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_17/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_17/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_18/kernel", "shape": [3, 3, 256, 512]}, {"dtype": "float32", "name": "conv2d_18/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_19/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_19/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_3/kernel", "shape": [512, 1]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [1]}]}], "format": "layers-model", "generatedBy": "keras v2.2.4", "modelTopology": {"training_config": {"optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "amsgrad": false, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "epsilon": 1e-07}}, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "binary_crossentropy", "loss_weights": null}, "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_3", 0, 0]], "name": "cnn_pool", "output_layers": [["dense_3", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "name": "input_3", "sparse": false}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"name": "conv2d_11", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_22", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": true}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"name": "conv2d_12", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_23", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": true}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"name": "conv2d_13", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_24", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": true}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "padding": "same", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"name": "conv2d_14", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_25", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": true}}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"name": "conv2d_15", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_26", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "name": "activation_26", "config": {"activation": "relu", "name": "activation_26", "trainable": true}}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "padding": "same", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"name": "conv2d_16", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_27", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "name": "activation_27", "config": {"activation": "relu", "name": "activation_27", "trainable": true}}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"name": "conv2d_17", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_28", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "name": "activation_28", "config": {"activation": "relu", "name": "activation_28", "trainable": true}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "padding": "same", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"name": "conv2d_18", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_29", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "name": "activation_29", "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"name": "conv2d_19", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_30", "epsilon": 0.001, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "center": true, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "name": "activation_30", "config": {"activation": "relu", "name": "activation_30", "trainable": true}}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "class_name": "GlobalMaxPooling2D", "name": "global_max_pooling2d_1", "config": {"trainable": true, "name": "global_max_pooling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "sigmoid", "units": 1, "use_bias": true}}]}}, "keras_version": "2.2.4"}, "convertedBy": "TensorFlow.js Converter v2.3.0"}