{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_31/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_31/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_31/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_31/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_32/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_32/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_32/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_32/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_33/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_33/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_33/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_33/moving_variance"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_34/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_34/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_34/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_34/moving_variance"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_35/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_35/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_35/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_35/moving_variance"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_36/gamma"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_36/beta"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_36/moving_mean"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_36/moving_variance"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_37/gamma"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_37/beta"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_37/moving_mean"}, {"shape": [256], "dtype": "float32", "name": "batch_normalization_37/moving_variance"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_38/gamma"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_38/beta"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_38/moving_mean"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_38/moving_variance"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_39/gamma"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_39/beta"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_39/moving_mean"}, {"shape": [512], "dtype": "float32", "name": "batch_normalization_39/moving_variance"}, {"shape": [3, 3, 3, 32], "dtype": "float32", "name": "conv2d_20/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_20/bias"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_21/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_21/bias"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_22/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_22/bias"}, {"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_23/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_23/bias"}, {"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_24/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_24/bias"}, {"shape": [3, 3, 128, 256], "dtype": "float32", "name": "conv2d_25/kernel"}, {"shape": [256], "dtype": "float32", "name": "conv2d_25/bias"}, {"shape": [3, 3, 256, 256], "dtype": "float32", "name": "conv2d_26/kernel"}, {"shape": [256], "dtype": "float32", "name": "conv2d_26/bias"}, {"shape": [3, 3, 256, 512], "dtype": "float32", "name": "conv2d_27/kernel"}, {"shape": [512], "dtype": "float32", "name": "conv2d_27/bias"}, {"shape": [3, 3, 512, 512], "dtype": "float32", "name": "conv2d_28/kernel"}, {"shape": [512], "dtype": "float32", "name": "conv2d_28/bias"}, {"shape": [512, 1], "dtype": "float32", "name": "dense_4/kernel"}, {"shape": [1], "dtype": "float32", "name": "dense_4/bias"}]}], "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0", "generatedBy": "keras v2.2.4", "modelTopology": {"training_config": {"sample_weight_mode": null, "optimizer_config": {"config": {"epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "loss_weights": null, "metrics": ["accuracy"], "loss": "binary_crossentropy"}, "backend": "tensorflow", "keras_version": "2.2.4", "model_config": {"config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 128, 128, 3], "name": "input_4"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_4"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_20", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_31", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_31"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]], "class_name": "Activation", "name": "activation_31"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_21", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["activation_31", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_32", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_32"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_32"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "class_name": "Activation", "name": "activation_32"}, {"config": {"strides": [2, 2], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_22", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["activation_32", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_33", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_33"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_33"}, "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "class_name": "Activation", "name": "activation_33"}, {"config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "max_pooling2d_4"}, "inbound_nodes": [[["activation_33", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.4, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_23", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 128, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_34", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_34"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_34"}, "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]], "class_name": "Activation", "name": "activation_34"}, {"config": {"strides": [2, 2], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_24", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 128, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["activation_34", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_35", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_35"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "name": "activation_35"}, {"config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "max_pooling2d_5"}, "inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_5"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.4, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_25", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_36", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_36"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Activation", "name": "activation_36"}, {"config": {"strides": [2, 2], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_26", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["activation_36", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_37", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_37"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_37"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "class_name": "Activation", "name": "activation_37"}, {"config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "max_pooling2d_6"}, "inbound_nodes": [[["activation_37", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_6"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.4, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_27", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 512, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_38", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_38"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_38"}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]], "class_name": "Activation", "name": "activation_38"}, {"config": {"strides": [2, 2], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_28", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 512, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["activation_38", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_39", "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_39"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_39"}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]], "class_name": "Activation", "name": "activation_39"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_max_pooling2d_2"}, "inbound_nodes": [[["activation_39", 0, 0, {}]]], "class_name": "GlobalMaxPooling2D", "name": "global_max_pooling2d_2"}, {"config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "sigmoid"}, "inbound_nodes": [[["global_max_pooling2d_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4"}], "input_layers": [["input_4", 0, 0]], "name": "cnn_dropout"}, "class_name": "Model"}}}