{"generatedBy": "keras v2.4.0", "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0", "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d/kernel", "shape": [3, 3, 3, 32]}, {"dtype": "float32", "name": "conv2d/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_3/kernel", "shape": [3, 3, 64, 128]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_4/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_5/kernel", "shape": [3, 3, 128, 256]}, {"dtype": "float32", "name": "conv2d_5/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_6/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_6/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_7/kernel", "shape": [3, 3, 256, 512]}, {"dtype": "float32", "name": "conv2d_7/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_8/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_8/bias", "shape": [512]}, {"dtype": "float32", "name": "dense/kernel", "shape": [512, 1]}, {"dtype": "float32", "name": "dense/bias", "shape": [1]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"model_config": {"class_name": "Model", "config": {"output_layers": [["dense", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 128, 128, 3], "name": "input_1", "ragged": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation", "trainable": true}, "name": "activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_1"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_2", "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_2"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d"}, "name": "max_pooling2d"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"rate": 0.4, "seed": null, "trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout"}, "name": "dropout"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_3", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_3"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_4", "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_4"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"rate": 0.4, "seed": null, "trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_5", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_5"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_6", "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_6"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"rate": 0.4, "seed": null, "trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_7", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_7"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "name": "conv2d_8", "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "groups": 1, "filters": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "conv2d_8"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8"}, {"class_name": "GlobalMaxPooling2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "name": "global_max_pooling2d", "trainable": true}, "name": "global_max_pooling2d"}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling2d", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "activation": "sigmoid", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32"}, "name": "dense"}], "name": "cnn_dropout", "input_layers": [["input_1", 0, 0]]}}, "keras_version": "2.4.0", "backend": "tensorflow", "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "beta_2": 0.9990000128746033, "learning_rate": 0.0010000000474974513, "name": "Adam", "epsilon": 1e-07}}, "metrics": ["accuracy"], "weighted_metrics": null}}}